# HomeBrew Dependencies

brew "p7zip"
brew "openssl"
brew "python"
brew "aws-shell"
brew "awscli"
brew "bash"
brew "bind"
brew "ccat"
brew "cfn-lint"
brew "gh"
brew "gist"
brew "git"
brew "glances"
brew "gnupg"
brew "go"
brew "hopenpgp-tools"
brew "htop"
brew "jq"
brew "kind"
brew "node"
brew "npm"
brew "openssh"
brew "pinentry-mac"
brew "pyenv"
brew "pyenv-virtualenv"
brew "shellcheck"
brew "speedtest-cli"
brew "tfenv"
brew "tree"
brew "vault"
brew "vim"
brew "watch"
brew "wget"
brew "ykman"
brew "zsh"
brew "zsh-completions"
brew "aws/tap/aws-sam-cli"
brew "kwilczynski/pkenv/pkenv"

# Casks
cask "1password"
cask "atom"
cask "chefdk"
cask "divvy"
cask "docker"
cask "dozer"
cask "iterm2"
cask "google-chrome"
cask "google-cloud-sdk"
cask "gpg-suite"
cask "jetbrains-toolbox"
cask "logitech-options"
cask "notion"
cask "keepingyouawake"
cask "notion"
cask "postman"
cask "signal"
cask "slack"
cask "spotify"
cask "sublime-text"
cask "vagrant"
cask "viscosity"
cask "visual-studio-code"
cask "whatsapp"
cask "yubico-yubikey-manager"

# Taps
tap "aws/tap"
tap "dkanejs/aws-session-manager-plugin"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-drivers"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "kwilczynski/pkenv"
